/*
 TPOSApiClient.m
 */
"unknown_error"="未知异常";
"unknown_data_type"="返回資料類型錯誤";

/*
 TPOSGuideViewController.m
 */
"self_controlled"="自我掌控資產";
"p2p_trans"="點對點自由轉帳";
"dapps_browser"="DApps瀏覽器";
"easy_trade"="輕鬆交易資產";
"welcome_2"="歡迎來到新世界";
"enter_tp"="進入Token Pocket";

/*
 TPOSTabBarController.m
 */
"Assets"="資產";
"Markets"="行情";
"Discover"="發現";
"Profile"="我的";
"Exchanges"="交易";

/*
 TPOSCustomMJRefreshFooter.m
 */
"reach_bottom"="哎呀，到底了";
"slide_load_more"="上滑加載更多";
"loading_more"="正在加載更多…";

/*
 TPOSCameraUtils.m
 */
"warm_tip"="溫馨提示";
"camera_setting_tips"="請去-> [設定- TokenPocket -相機]打開訪問開關";
"confirm"="確定";
"album_access_failed"="因為系統原因，無法訪問相册";
"no_camera"="未檢測到您的監視器";

/*
 NSDate+TPOS.m
 */
"just_now"="剛剛";
"one_min_ago"="分鐘前";
"n_min_ago"="分鐘前";
"one_h_ago"="小時前";
"n_h_ago"="小時前";
"one_day_ago"="天前";
"n_day_ago"="天前";
"one_m_ago"="月前";
"n_m_ago"="月前";
"one_y_ago"="年前";
"n_y_ago"="年前";

"trans_record"="交易記錄";
"trans_succ"="交易成功";
"trans_fail"="交易失敗";
"transing"="交易處理中";
"copy_to_board"="已複製到粘貼板";
"trans_query"="交易査詢";
"trans_detail"="交易詳情";

"transaction"="轉帳";
"has_error"="發生錯誤";
"package_fail"="打包失敗";
"packaging"="已提交，打包中";
"trans_suc"="轉帳成功";
"trans_fai"="轉帳失敗";
"choose_token"="請選擇token";
"missing_wallet_addr"="請輸入錢包地址";
"missing_trans_amount"="請輸入轉帳數量";
"trans_to_self"="不能給自己轉帳";
"wrong_addr_tips"="請輸入正確的錢包地址";
"no_enough_token"="餘額不足";
"next_step"="下一步";
"token_trans"="轉帳代幣";
"choose_token"="請選擇代幣";
"wallet_addr"="錢包地址";
"input_paste_addr"="輸入或粘貼錢包地址";

"trans_amount"="轉帳數量";
"input_out_amount"="輸入轉出金額";
"miner_fee"="礦工費";
"select_fee"="請選擇礦工費";
"comment"="備註";
"trans_num"="交易號";
"blc_num"="區塊高度";
"trans_time"="交易時間";
"copy_url"="複製URL";
"choose_token_trans"="選擇代幣轉帳";

"req_exchange_list_fail"="拉取交易清單失敗";

"add_new_tokens"="添加新資產";
"wrong_and_try_later"="出錯了，請稍後重試";
"all"="全部";

"receive"="收款";
"receiver"="收款方";
"copied"="已複製";
"copy_wallet_addr"="複製收款地址";
"rece_amount"="收款金額";
"set_rec_amount"="請設定收款金額";

"cannot_recog_qrcode"="暫未識別出掃描的二維碼";
"align_qrcode"="將二維碼放入框內，即可自動掃描";
"album"="相册";
"scan"="掃一掃";

"input_asset_name"="請輸入資產名稱";
"cancel"="取消";
"confirm"="確認";
"hot_coin"="熱門代幣";
"coming_soon"="詳情即將上線，敬請期待";

"add_tokens"="添加資產";
"support_token_tip"="支持SWTC等區塊鏈資產一站式管理";
"all_wallet"="全部錢包";
"no_wallet_tips"="您當前還沒有錢包哦，快去創建吧~";
"ok"="好的";

"how_to"="如何設定參數？";
"advanced"="高級選項";

"custom_gas_price"="自定義Gas Price";
"custom_gas"="自定義Gas";

/*
 TPOSTransactionConfirmView.m
 */
"input_pwd"="請輸入密碼";
"confirm"="確認";

/*
 TPOSAssetHeader.m
 */
"my_asset"="我的資產";

/*
 TPOSAssetPopWindow.m
 */
"create_wallet"="創建錢包";


/*
 TPOSSearchTokenCell.m
 */
"added"="已添加";
"add"="添加";

/*
 TPOSAssetCreateWalletView.m
 */
"all_wallet"="全部錢包";
"has_no"="未創建";
"wallet"="錢包";
"s_wallet"="的錢包";
"s_only_token_chain"="的數位代幣只能存放在該體系的錢包中";

/*
 TPOSDiscoveryViewController.m
 */
"dapp_recomd"="Dapp推薦";
"hot_articles"="熱門與文章";

/*
 TPOSExchangeWalletVewController.m
 */
"switch_account"="切換帳戶";

/*
 TPOSMineViewController.m
 */
"personal_center"="個人中心";
"msg"="消息中心";
"contact"="連絡人";
"help"="幫助中心";
"about"="關於我們";
"settings"="系統設置";
"point_settings"="節點設置";
"version"="當前版本";
"lang_setting"="多語言";
"copyright_info"="版權信息";
"transfer_action"="錢包轉賬";
"receive_action"="我要收款";

/*
 DOSPointSettingViewController.m
 */
"defult_node"="默認節點";
"custom_node"="自定義節點";
"add_custom_node"="添加自定義節點";
"node_warn"="請輸入合法的節點地址";

/*
 TPOSEditWalletViewController.m
 */
"saving"="保存中...";
"save_succ"="保存成功";
"save_fail"="保存失敗";
"save"="保存";
"delete_caution"="請謹慎，此操作無法撤銷";
"delete_succ"="删除成功";
"delete_fail"="删除失敗";
"pwd_error"="密碼錯誤";
"pwd_not_match"="密碼不一致，請重試";

/*
 TPOSSettingViewController.m
 */
"login_pwd"="密碼登入";
"login_faceid"="面部識別";
"login_touchid"="指紋識別";
"language"="多語言";
"currency_unit"="貨幣單位";
"web3_setting"="web3設定";
"set"="設定";
"cancel"="取消";

/*
 TPOSMessageCenterViewController.m
 */
"read_all"="全部已讀";

/*
 TPOSMemonicImportWalletViewController.m
 */
"custom_path"="自定義路徑";
"service_privacy"="服務及隱私條款";
"pwd_not_match"="密碼不一致，請確認後再輸入";
"importing"="導入中...";
"m_new_wallet"="M-新錢包";
"import_succ"="導入成功";
"import_fail"="導入失敗";

/*
 TPOSPrivateKeyImportWalletViewController.m
 */
"term_service"="服務協定";
"wallet_exist"="錢包已存在";
"pk_wallet"="PK-新錢包";

/*
 TPOSChooseTokenSystemViewController.m
 */
"choose_blc_type"="選擇幣種體系";
"created"="已創建";
"blc_type_wallet"="體系錢包";

/*
 TPOSImportWalletViewController.m
 */
"import_wallet"="導入錢包";
"mnemonic"="助記詞";
"pri_key"="私密金鑰";


/*
 TPOSCreateMemonicViewController.m
 */
"backup_mnem"="備份助記詞";
"backup_mnem_tips"="助記詞用於恢復錢包或重置錢包密碼，將它準確的抄寫在紙上，並存放在只有你知道的安全的地方。";

/*
 TPOSConfirmMemonicViewController.m
 */
"confirm_result"="驗證結果";
"reconfirm_mnemonic"="助記詞順序驗證錯誤，請重新確認";
"backup_succ"="備份成功";

/*
 TPOSCreateWalletViewController.m
 */
"choose_wallet_chain_type"="請選擇錢包體系";
"complete_info"="請填寫完整的資訊";
"at_least_8"="密碼不可少於8比特";
"pwd_not_match"="兩次輸入密碼不一致";
"read_and_agree"="請閱讀並同意服務及隱私條款";
"tips"="提示";
"create_succ"="創建錢包成功";
"create_fail"="創建錢包失敗";

/*
 TPOSBackupWalletViewController.m
 */
"backup_wallet"="備份錢包";

/*
 TPOSSelectChainTypeViewController.m
 */
"choose_blc_type"="選擇錢包體系";
"chain_info_retry"="體系資訊獲取失敗，請重試";
"already_wallet"="無法導入，您已創建";

/*
 TPOSWalletManagerViewController.m
 */
"wallet_manage"="錢包管理";
"total_asset"="資產總覽";
/*
 TPOSAboutUsViewController.m
 */
"pri_policy"="隱私策略";
"ver_release"="版本日誌";
"check_update"="檢測新版";
"app_guide"="產品嚮導";

/*
 TPOSEditPasswordViewController.m
 */
"modify_succ"="修改成功";
"change_pwd"="更改密碼";
"done"="完成";

/*
 TPOSMessageCenterCell.m
 */
"receiver"="接收方";
"trans_succ"="轉帳成功";
"trans_noti"="轉帳通知";
"sender"="發送方";


/*
 TPOSChooseTokenSystemCell.m
 */
"blc_type"="體系";

/*
 TPOSPasswordView.m
 */
"weak"="弱";
"normal"="一般";
"good"="很好";
"safe"="安全";

/*
 TPOSAboutUsCell.m
 */
"curr_version"="當前版本：";

/*
 TPOSWalletChainCell.m
 */
"created"="已創建";

/*
 TPOSTransactionRecoderCell.m
 */
"processing"="打包中";

/*
 TPOSMarketEditViewController.m
 */
"all_select"="全選";
"unselect"="全不選";
"delete_fail_retry"="删除失敗，請重試";
"delete"="删除";

/*
 TPOSMarketViewController.m
 */
"no_token_go_add"="您還沒有代幣，趕緊去添加吧~";

/*
 TPOSMarketSearchViewController.m
 */
"search_token_market"="蒐索代幣行情";
"add_fail"="添加失敗";
"hot_rec"="熱門推薦";

/*
 TPOSJTManager.m
 */
"missing_param"="缺少參數";
"sign_failed"="本地簽名失敗";

/*
 TPOSAuthPasswordViewController.m
 */
"set_pwd"="請先設置密碼";
"repeat_pwd"="請再次輸入密碼";
"input_pwd_auth"="請輸入密碼，以驗證身份";
"contact_us"="出問題了，趕緊和我們聯系吧";
"wrong_pwd"="密碼不正確，請重新輸入";
"no_deviceId"="對不起，當前設備不支持指紋/面部ID";
"deviceId_wrong"="指紋/面部ID不正確，驗證失敗";
"auth_failed"="驗證失敗";
"auth_fail_to_pwd"="多次錯誤，指紋/面部ID已被鎖定，請到手機解鎖介面輸入密碼";
"setting_succ"="設定成功";

/*
 TPOSForceCreateWalletViewController.m
 */
"usr_agreement"="使用者協定";

/*
 TPOSEnterAuthViewController.m
 */
"auth_pwd"="密碼驗證";
"touch_pwd"="點擊進行密碼驗證";
"touch_touchId"="點擊喚醒指紋驗證";
"touch_faceId"="點擊喚醒面部驗證";

/*
 AppDelegate.m
 */
"update_tips"="Token Pocket已更新，有更棒的體驗和功能，快快下載吧~";
"go_download"="前往下載";

/*
 JHPieChart.m
 */
"amount"="數量";
"rate"="占比";

/*
 TPOSAuthID.m
 */
"input_pwd"="輸入密碼";
"auth_with_touchId"="通過Home鍵驗證已有指紋";

/*
 TPOSTransactionEmptyView
 */
"soon"="敬請期待";
"de_exchange"="去中心化的全球數位資產交易所";

/*
 TPOSMarketHeader.h
 */
"now_price"="最新價";
"change_ratio"="漲跌幅";
"no_market_tendency"="当前暂无行情";
"add_tendency"="添加行情";

"pay_wallet"="付款錢包";
"trans_out"="轉入地址";
"trans_info"="訂單資訊";
"trans_detail"="支付詳情";
"confirm_trans"="確認支付";

"fee_setting"="礦工費設定";
"gas_slow"="慢";
"gas_fast"="快";
"gas_rec"="推薦";


"wallet_delete"="删除錢包";
"wallet_name"="錢包名稱";
"wallet_addr"="錢包地址";
"change_pwd"="修改密碼";
"export_pk"="導出私鑰";
"wallet_export"="導出錢包";
"addr_copy"="複製";

"pwd_curr"="當前密碼";
"pwd_new"="新密碼";
"pwd_repeat"="確認密碼";
"pwd_forget"="忘記密碼？導入私鑰可重置密碼。";
"import_imid"="馬上導入";

"pla_pwd_curr"="當前密碼";
"pla_pwd_new"="新密碼";
"pla_pwd_repeat"="確認密碼";

"total_asset_title"="總資產";

"title_share_to"="分享到";
"title_button_cancel"="取消";
"wx_frnds"="微信好友";
"wx_timeline"="朋友圈";
"share_qq"="QQ";

"backup_wallet_line"="為了您錢包 %@ 的安全";
"backup_tips"="請備份私鑰或助記詞";

"tip_one"="密碼用於保護私鑰和交易授權，强度非常重要";
"tip_two"="TokenPocket不存儲密碼，也無法幫您找回，請務必牢記";

"wallet_foundation"="錢包體系";
"wallet_name"="錢包名稱";
"set_pwd"="設置密碼";
"repeat_pwd"="確認密碼";
"pwd_hint"="提示資訊";
"pwd_optional"="可不填";
"read_agree"="我已仔細閱讀並同意";
"input_private_key"="請輸入明文私鑰";
"input_mnemonic_words"="請輸入助記詞，按空格做分隔";
"derive_path"="取回路徑";
"import_start"="開始導入";

"pwd_length_tip"="不少於8位字符，建議混合大小寫字母、數字、特殊符號";
"pwd_length_weak"="密碼強度太低，極易被駭客破解";

"mnemonic_write_down"="抄寫下你的錢包助記詞";
"confirm_mnemonic_title"="確認你的錢包助記詞";
"confirm_mnemonic_desc"="請按順序點擊助記詞，驗證您備份的助記詞是否正確";
"entry_agree"="進入即代表同意服務協議和隱私條款";
"tap_reauth"="點擊再次認證";

"send_trans_fail"="發送交易失敗";
"desc_wrong_pwd"="密碼不正確";

"backup_wallet_line_prefix"="為了您錢包 ";
"backup_wallet_line_suffix"=" 的安全";
"backup_tips"="請備份私鑰或助記詞";
"backup_now"="立即備份";

"read_first"="請閱讀並同意服務條款";
"illegal_mnem"="非法助記詞，請檢查";

"about_us_desc"="Doughnut是一款移動端輕錢包APP，它旨在為普通用戶提供一款安全放心、簡單好用、功能强大的數位資產錢包";
